# 1st program
print('Задача 1 ---------------')
print((9 ** 0.5) * 5)

# 2nd program
print('Задача 2 ---------------')
print((9.99 > 9.98) and (1000 != 1000.1))

# 3rd program
print('Задача 3 ---------------')
print(2 * 2 + 2)
print(2 * (2 + 2))
print('(2 * 2 + 2) < (2 * (2 + 2) : это ', (2 * 2 + 2) < (2 * (2 + 2)))
print('(2 * 2 + 2) == (2 * (2 + 2) : это ', (2 * 2 + 2) == (2 * (2 + 2)))
print('(2 * 2 + 2) > (2 * (2 + 2) : это ', (2 * 2 + 2) > (2 * (2 + 2)))

#4th program
print('Задача 4 ---------------')
print((int(float('123.456') * 10)) % 10)